import { NamesReducerState } from "../types/namesReducerTypes";

export const renderMessages = (names: NamesReducerState) => {
	let messages: string = "";

	names.forEach((name, i) => {
		messages += `احب اوضح ليكم حاجة صاحبكم ${name} العميل فى اخر المكالمة معاه طلب حد يكلمه علشان يشكر ${name} على الأسلوب و الطريقة ال اتعامل معاه بيها و باعت رسالة شكر ليه و حبيت أوضح للناس كلها الكلام دا علشان الكل يعمل زى احمد و ياريت كلنا يبقى اسلوبنا حلو مع العملاء و الطريقة علشان بدل ما واحد بس يتشكر لاء الكل يتشكر و ياريت الناس كلها تمشى على النمط دا يكون الاسكريبت كويس و نعرض على العملاء و يكون اسلوبنا حلو مع العملاء لان طبعا انتم عارفين ان فى عميل خفى و ممكن الله اعلم يكون هو دا سواء هو ولا لاء بس كلنا نمشى صح علشان محدش يمسك علينا غلط و نحب كلنا نشكر ${name} المجهود و كان الله فى عونكم جميعا و دائما فى تقدم يارجالة ❤️❤️💪`;
		if (i + 1 !== names.length) {
			messages += "\n\n------------------------\n\n";
		}
	});

	return messages;
};
